Tekla.Structures.Plugins.PluginBase.CoordinateSystemType
Defines the coordinate system type for model plug-ins which are using points as an input.

Tekla.Structures.Plugins.PluginBase.CoordinateSystemType.FROM_FIRST_POINT_AND_GLOBAL
Plugin coordinate system is calculated from first input point defining the origin
and global coordinates which defines x and y-direction.

Tekla.Structures.Plugins.PluginBase.CoordinateSystemType.FROM_FIRST_AND_SECOND_POINT
Plugin coordinate system is calculated from first input point defining the origin and
second input point which defines x-direction.